InformationRegisters/АС_ИндексOEMНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АС_ИндексOEMНоменклатуры</Name>
			<Comment>Служебный индекс нормализованных OEM для быстрого поиска аналогов.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>КлючOEM</Name>
					<Comment>OEM в нижнем регистре, содержащий только латинские буквы и цифры.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОстаткиТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/АС_OEMАналоги/Ext/Form/Module.bsl
&НаКлиенте
Перем АС_КурсорыСтраниц;

&НаСервере
Процедура АС_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не Параметры.Свойство("Номенклатура")
		Или Не ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	АС_НоменклатураФормы = Параметры.Номенклатура;
	АС_СкладФормы = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	Если Параметры.Свойство("Склад") И ЗначениеЗаполнено(Параметры.Склад) Тогда
		АС_СкладФормы = Параметры.Склад;
	КонецЕсли;
	АС_СтрокаПоиска = "";
	АС_ПримененнаяСтрокаПоиска = "";
	АС_ИндексOEMСервер.ОбеспечитьИндекс();
	АвтоЗаголовок = Ложь;
	Заголовок = "OEM-аналоги: " + Строка(АС_НоменклатураФормы);
	АС_ЗагрузитьСтраницуНаСервере("", Справочники.Номенклатура.ПустаяСсылка(), 1, "");

КонецПроцедуры

&НаКлиенте
Процедура АС_ПриОткрытии(Отказ)

	АС_СброситьКурсорыСтраниц();

КонецПроцедуры

&НаКлиенте
Процедура АС_СброситьКурсорыСтраниц()

	АС_КурсорыСтраниц = Новый Массив;
	АС_КурсорыСтраниц.Добавить(Новый Структура("OEM, Номенклатура", "",
		ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка")));

КонецПроцедуры

&НаКлиенте
Процедура АС_Найти(Команда)

	АС_ЗагрузитьСтраницуНаСервере("",
		ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"), 1, СокрЛП(АС_СтрокаПоиска));
	АС_СброситьКурсорыСтраниц();

КонецПроцедуры

&НаКлиенте
Процедура АС_Обновить(Команда)

	АС_ЗагрузитьСтраницуНаСервере("",
		ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"), 1, АС_ПримененнаяСтрокаПоиска);
	АС_СброситьКурсорыСтраниц();

КонецПроцедуры

&НаКлиенте
Процедура АС_СледующаяСтраница(Команда)

	Если Не АС_ЕстьСледующаяСтраница Тогда
		Возврат;
	КонецЕсли;
	Курсор = Новый Структура("OEM, Номенклатура", АС_ПоследнийOEM, АС_ПоследняяНоменклатура);
	АС_ЗагрузитьСтраницуНаСервере(Курсор.OEM, Курсор.Номенклатура,
		АС_НомерСтраницы + 1, АС_ПримененнаяСтрокаПоиска);
	// В памяти клиента остаются только начала посещенных страниц, без строк товаров.
	Пока АС_КурсорыСтраниц.Количество() >= АС_НомерСтраницы Цикл
		АС_КурсорыСтраниц.Удалить(АС_КурсорыСтраниц.Количество() - 1);
	КонецЦикла;
	АС_КурсорыСтраниц.Добавить(Курсор);

КонецПроцедуры

&НаКлиенте
Процедура АС_ПредыдущаяСтраница(Команда)

	Если АС_НомерСтраницы <= 1 Тогда
		Возврат;
	КонецЕсли;
	ПредыдущаяСтраница = АС_НомерСтраницы - 1;
	Курсор = АС_КурсорыСтраниц[ПредыдущаяСтраница - 1];
	АС_ЗагрузитьСтраницуНаСервере(Курсор.OEM, Курсор.Номенклатура,
		ПредыдущаяСтраница, АС_ПримененнаяСтрокаПоиска);

КонецПроцедуры

&НаСервере
Процедура АС_ЗагрузитьСтраницуНаСервере(OEMПосле, НоменклатураПосле, НомерСтраницы, ПримененнаяСтрокаПоиска)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 101
		|ИндексИсходной.КлючOEM КАК OEM,
		|Аналоги.Ссылка КАК Номенклатура
		|ИЗ РегистрСведений.АС_ИндексOEMНоменклатуры КАК ИндексИсходной
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АС_ИндексOEMНоменклатуры КАК ИндексАналогов
		|ПО ИндексАналогов.КлючOEM = ИндексИсходной.КлючOEM
		|И ИндексАналогов.Номенклатура <> &Номенклатура
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Аналоги
		|ПО ИндексАналогов.Номенклатура = Аналоги.Ссылка
		|ГДЕ ИндексИсходной.Номенклатура = &Номенклатура
		|И НЕ Аналоги.ЭтоГруппа
		|И НЕ Аналоги.ПометкаУдаления
		|И НЕ Аналоги.Недействителен
		|И Аналоги.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
		|И (НЕ &ОтборПоКурсору ИЛИ ИндексИсходной.КлючOEM > &OEMПосле
		| ИЛИ ИндексИсходной.КлючOEM = &OEMПосле И Аналоги.Ссылка > &НоменклатураПосле)
		|И (&БезПоиска
		| ИЛИ ИндексИсходной.КлючOEM ПОДОБНО &ПоискOEM СПЕЦСИМВОЛ ""~""
		| ИЛИ Аналоги.Наименование ПОДОБНО &Поиск СПЕЦСИМВОЛ ""~""
		| ИЛИ Аналоги.Артикул ПОДОБНО &Поиск СПЕЦСИМВОЛ ""~"")
		|УПОРЯДОЧИТЬ ПО OEM, Номенклатура");
	Запрос.УстановитьПараметр("Номенклатура", АС_НоменклатураФормы);
	Запрос.УстановитьПараметр("ОтборПоКурсору", НомерСтраницы > 1);
	Запрос.УстановитьПараметр("OEMПосле", OEMПосле);
	Запрос.УстановитьПараметр("НоменклатураПосле", НоменклатураПосле);
	Запрос.УстановитьПараметр("БезПоиска", ПустаяСтрока(ПримененнаяСтрокаПоиска));
	Запрос.УстановитьПараметр("Поиск", АС_СтрокаПодобия(ПримененнаяСтрокаПоиска));
	ПоискOEM = АС_ИндексOEMСервер.НормализоватьOEM(ПримененнаяСтрокаПоиска);
	Если ПустаяСтрока(ПоискOEM) Тогда
		ПоискOEM = ПримененнаяСтрокаПоиска;
	КонецЕсли;
	Запрос.УстановитьПараметр("ПоискOEM", АС_СтрокаПодобия(ПоискOEM));
	ТаблицаСтраницы = Запрос.Выполнить().Выгрузить();
	ЕстьСледующаяСтраница = ТаблицаСтраницы.Количество() > 100;
	Если ЕстьСледующаяСтраница Тогда
		ТаблицаСтраницы.Удалить(100);
	КонецЕсли;
	ТаблицаСтраницы.Колонки.Добавить("Количество",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));

	НоменклатураСтраницы = Новый Массив;
	УникальнаяНоменклатура = Новый Соответствие;
	Для Каждого СтрокаСтраницы Из ТаблицаСтраницы Цикл
		Если УникальнаяНоменклатура.Получить(СтрокаСтраницы.Номенклатура) = Неопределено Тогда
			УникальнаяНоменклатура.Вставить(СтрокаСтраницы.Номенклатура, Истина);
			НоменклатураСтраницы.Добавить(СтрокаСтраницы.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	Если НоменклатураСтраницы.Количество() > 0 Тогда
		ЗапросОстатков = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|Остатки.Номенклатура КАК Номенклатура,
			|СУММА(Остатки.Количество) КАК Количество
			|ИЗ РегистрСведений.ОстаткиТоваров КАК Остатки
			|ГДЕ Остатки.Номенклатура В (&НоменклатураСтраницы)
			|И (НЕ &ОтборПоСкладу ИЛИ Остатки.СтруктурнаяЕдиница В ИЕРАРХИИ(&Склад))
			|СГРУППИРОВАТЬ ПО Остатки.Номенклатура");
		ЗапросОстатков.УстановитьПараметр("НоменклатураСтраницы", НоменклатураСтраницы);
		ЗапросОстатков.УстановитьПараметр("ОтборПоСкладу", ЗначениеЗаполнено(АС_СкладФормы));
		ЗапросОстатков.УстановитьПараметр("Склад", АС_СкладФормы);
		ОстаткиПоНоменклатуре = Новый Соответствие;
		Выборка = ЗапросОстатков.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОстаткиПоНоменклатуре.Вставить(Выборка.Номенклатура, Выборка.Количество);
		КонецЦикла;
		Для Каждого СтрокаСтраницы Из ТаблицаСтраницы Цикл
			Количество = ОстаткиПоНоменклатуре.Получить(СтрокаСтраницы.Номенклатура);
			СтрокаСтраницы.Количество = ?(Количество = Неопределено, 0, Количество);
		КонецЦикла;
	КонецЕсли;

	// Меняем реквизиты формы после успешного получения обоих результатов.
	ЗначениеВРеквизитФормы(ТаблицаСтраницы, "АС_СписокOEMАналогов");
	АС_ПримененнаяСтрокаПоиска = ПримененнаяСтрокаПоиска;
	АС_НомерСтраницы = НомерСтраницы;
	АС_ЕстьСледующаяСтраница = ЕстьСледующаяСтраница;
	Если ТаблицаСтраницы.Количество() > 0 Тогда
		ПоследняяСтрока = ТаблицаСтраницы[ТаблицаСтраницы.Количество() - 1];
		АС_ПоследнийOEM = ПоследняяСтрока.OEM;
		АС_ПоследняяНоменклатура = ПоследняяСтрока.Номенклатура;
		АС_СостояниеСтраницы = СтрШаблон("Страница %1. Показано строк: %2%3",
			НомерСтраницы, ТаблицаСтраницы.Количество(),
			?(ЕстьСледующаяСтраница, ". Есть следующая страница", ". Последняя страница"));
	Иначе
		АС_ПоследнийOEM = OEMПосле;
		АС_ПоследняяНоменклатура = НоменклатураПосле;
		АС_СостояниеСтраницы = "Аналоги по OEM не найдены";
	КонецЕсли;
	Элементы.АС_Назад.Доступность = НомерСтраницы > 1;
	Элементы.АС_Далее.Доступность = ЕстьСледующаяСтраница;

КонецПроцедуры

&НаСервереБезКонтекста
Функция АС_СтрокаПодобия(Текст)

	Результат = СтрЗаменить(Текст, "~", "~~");
	Результат = СтрЗаменить(Результат, "%", "~%");
	Результат = СтрЗаменить(Результат, "_", "~_");
	Результат = СтрЗаменить(Результат, "[", "~[");
	Результат = СтрЗаменить(Результат, "]", "~]");
	Возврат "%" + Результат + "%";

КонецФункции

&НаКлиенте
Процедура АС_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если Лев(ИмяСобытия, 7) = "Запись_" И ИмяСобытия <> "Запись_Файл"
		Или ИмяСобытия = "АС_Запись_ПриходнаяНакладная"
		Или ИмяСобытия = "АС_Запись_ЗаказПоставщикуБезЗаказа" Тогда
		АС_Обновить(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АС_СписокOEMАналоговВыбор(Элемент, ВыбраннаяСтрока, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",
		Новый Структура("Ключ", ТекущиеДанные.Номенклатура), ЭтаФорма);

КонецПроцедуры
